# Origin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid..::..Origin Property
FillGrid Class See Also
---
Gets and sets the origin of the fill grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public UV Origin { get; set; }
```

Visual Basic
---
```text
Public Property Origin As UV
	Get
	Set
```

Visual C++
---
```text
public:
property UV^ Origin {
	UV^ get ();
	void set (UV^ value);
}
```

# ### Field Value
The origin of the fill grid.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
FillGrid Class
Autodesk.Revit.DB Namespace